#ifndef  K_MERGE_H
#define  K_MERGE_H

#include "stdafx.h"

/************************************************************************/
/* 沿从叶子结点b[s]到根结点ls[0]的路径调整败者树。                            */
/************************************************************************/ 
void Adjust(LoserTree &ls, int s,int k);

/************************************************************************/
/* 已知b[0]到b[k-1]为完全二叉树ls的叶子结点，存有k个关键字，沿从叶子            */
/* 到根的k条路径将ls调整成为败者树。                                         */
/************************************************************************/
void CreateLoserTree(LoserTree &ls,int k);

/************************************************************************/
/* 利用败者树ls将编号从0到k-1的k个输入归并段中的记录归并到输出归并段。           */
/* b[0]至b[k-1]为败者树上的k个叶子结点，分别存放k个输入归并段中当前记录的关键字。 */
/************************************************************************/
void K_Merge(LoserTree &ls, External &b,int k);  

#endif